Revit 2027 API
Dimension.NumberOfSegments Property
The number of segments for the dimension.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int NumberOfSegments { get; }
Public ReadOnly Property NumberOfSegments As Integer
	Get
public:
property int NumberOfSegments {
	int get ();
}
member NumberOfSegments : int with get
Property Value
Int32
See Also
Reference
Dimension Class
Autodesk.Revit.DB Namespace